Revit 2015 API
FaceNode Class
 An output node that represents a Face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public class FaceNode : RenderNode
Visual Basic
Public Class FaceNode _
	Inherits RenderNode
Visual C++
public ref class FaceNode : public RenderNode
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceNode
See Also
FaceNode Members
Autodesk.Revit.DB Namespace